{
  "backend/main.mo": "Implements a signaling canister for WebRTC sessions, managing session creation, viewer joins, offers, candidates, and automatic session timeout cleanup.",
  "backend/migration.mo": "Defines a no-op migration module returning an empty state object.",
  "feature_evidence.json": "Lists feature evidence metadata linking product features to specific frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of numerous frontend files for reference or documentation purposes.",
  "frontend/index.css": "Global Tailwind-based style definitions including light/dark theme variables and base layout styling.",
  "frontend/index.html": "Minimal HTML entry point containing the root app container and script loader for the frontend.",
  "frontend/src/App.tsx": "Main React entry component handling screen navigation, viewer link parsing, and flow between camera, editor, gallery, live broadcast, and live viewer screens.",
  "frontend/src/components/camera/MobileCameraOverlay.tsx": "A responsive camera control overlay for mobile and desktop with capture modes, camera switching, timers, grid, mirroring, zoom, and recording actions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation buttons, app branding, and a theme toggle, adapting layout when on the camera screen.",
  "frontend/src/components/HelpModal.tsx": "A help dialog explaining camera permissions, video recording, and live streaming features using a modal with scrollable sections.",
  "frontend/src/components/ThemeToggle.tsx": "A button that toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/live/useLiveBroadcast.ts": "Hook managing live broadcast setup with WebRTC, signaling, session state, ICE handling, and cleanup.",
  "frontend/src/hooks/live/useLiveViewer.ts": "Hook for joining and viewing live streams via WebRTC, handling remote video, ICE candidates, and connection state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider managing authentication, identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hook placeholder for fetching backend metadata, currently returning empty data.",
  "frontend/src/hooks/useVideoRecorder.ts": "React hook that manages MediaRecorder-based video recording with state for errors, timing, and blob output.",
  "frontend/src/index.css": "Tailwind configuration and custom CSS variables for light/dark themes and camera-related utility classes.",
  "frontend/src/lib/filters.ts": "Canvas image filter utilities implementing effects like sepia, black-and-white, blur, and beauty smoothing.",
  "frontend/src/lib/live/signaling.ts": "Wrapper client for backend WebRTC signaling calls, handling offers, answers, and ICE candidate exchange.",
  "frontend/src/lib/storage.ts": "IndexedDB helpers for saving, retrieving, and deleting photos and videos in a local gallery.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, identity provider, and renders the main App component.",
  "frontend/src/pages/CameraScreen.tsx": "Camera UI screen handling photo capture, video recording, timers, overlays, and storing captured media.",
  "frontend/src/pages/EditorScreen.tsx": "Provides a full photo editor with filters, beauty adjustments, stickers, masks, cropping, rotation, and export options rendered onto a canvas.",
  "frontend/src/pages/GalleryScreen.tsx": "Displays stored photos and videos, enabling preview, deletion, export, and storage management with a unified media list.",
  "frontend/src/pages/LiveBroadcastScreen.tsx": "Starts and manages a live broadcast from the device camera, showing stream status, shareable session info, and viewer count.",
  "frontend/src/pages/LiveViewerScreen.tsx": "Allows users to join and watch a live stream using a session code, managing connection state and remote video playback.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins including typography, container queries, and custom utilities.",
  "project_state.json": "Defines project version, high‑level camera app goals, and a list of implemented feature records covering capture, filters, editing tools, gallery, persistence, and backend metadata integration."
}