{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Defines feature evidence entries linking feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend source files used for build planning.",
  "frontend/index.css": "Tailwind base/style configuration defining OKLCH theme variables and global styling rules with dark mode support.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing navigation between camera, editor, and gallery while defining shared Photo/Video types.",
  "frontend/src/components/camera/MobileCameraOverlay.tsx": "Renders mobile and desktop camera control overlays with buttons for switching camera, timers, grid, mirroring, zoom, and capture/record actions.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation buttons for camera and gallery plus theme toggle.",
  "frontend/src/components/HelpModal.tsx": "Help dialog explaining permissions, video recording, tools, filters, and storage using scrollable sections.",
  "frontend/src/components/ThemeToggle.tsx": "Button that toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, logout, stored identity restoration, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a metadata query that depends on the actor and currently returns placeholder data.",
  "frontend/src/hooks/useVideoRecorder.ts": "Implements a MediaRecorder-based video recording hook handling start, stop, pause, resume, errors, and blob URL generation.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables for light/dark modes, and utility styles for the camera UI.",
  "frontend/src/lib/filters.ts": "Provides canvas-based image filters and beauty effects including color adjustments, blur, sharpen, and edge detection.",
  "frontend/src/lib/storage.ts": "Provides IndexedDB helpers to save, retrieve, and delete photos and videos, generating video URLs from stored blobs.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/CameraScreen.tsx": "Implements camera UI for capturing photos and videos, handling timers, recording, previews, and saving media.",
  "frontend/src/pages/EditorScreen.tsx": "Provides a photo editing interface with filters, beauty tools, masks, rotations, stickers, and export options.",
  "frontend/src/pages/GalleryScreen.tsx": "Displays saved photos and videos with options to view, export, delete, and clear all media while tracking storage usage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography plugins, and container settings.",
  "project_state.json": "Describes the project’s state, versioning, and a list of implemented camera‑app features including capture, filters, editing tools, gallery, and persistence. Contains metadata for build planning without architectural notes or issues."
}