{
  "kind": "build_request",
  "title": "Add basic live online broadcast (WebRTC) with canister-based signaling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Add a new Live mode that allows a user to broadcast their camera stream to remote viewers over the internet using WebRTC peer connections, with clear in-app messaging that this is a basic peer-to-peer live feature (not a large-scale streaming platform).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "saya ingin orang bisa live secara online, apakah bisa?"
        ]
      },
      "acceptanceCriteria": [
        "Camera screen provides a Live mode entry point distinct from Photo/Video capture.",
        "Broadcaster can start a live session and sees a shareable session code/link.",
        "UI displays connection status (e.g., waiting for viewers/connected/ended) and errors in a user-friendly way.",
        "App copy shown to users is in English."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Implement a backend signaling API in the single Motoko actor to support WebRTC session negotiation between one broadcaster and viewers via polling-based message exchange (offers/answers/ICE candidates), including session creation and session termination.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "saya ingin orang bisa live secara online, apakah bisa?"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to: create a live session, join a live session, post signaling messages (SDP/ICE), fetch pending signaling messages, and end/cleanup a session.",
        "Signaling data is treated as transient; no video bytes are stored or relayed by the canister.",
        "API supports multiple sessions (at minimum, separate session IDs) and basic validation (session exists, session not ended)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a Viewer experience in the frontend that lets someone open a session link or enter a session code, establishes a WebRTC connection to the broadcaster using the canister signaling API, and plays the live stream with standard HTML5 video playback UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "saya ingin orang bisa live secara online, apakah bisa?"
        ]
      },
      "acceptanceCriteria": [
        "Viewer can join by session code and/or a shareable link generated by the broadcaster.",
        "Viewer sees a live video element that starts playing after successful connection.",
        "Viewer sees clear empty/loading/error states (e.g., invalid code, broadcaster offline, connection failed)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Update the in-app Help modal to include a new section explaining Live mode (how to start a live session, share/join a code/link, what permissions are needed, and key limitations like peer-to-peer reliability and that the backend does not host the video).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "saya ingin orang bisa live secara online, apakah bisa?"
        ]
      },
      "acceptanceCriteria": [
        "Help modal contains a clearly labeled 'Live' (or 'Live Streaming') section in English.",
        "Help content describes: starting Live, sharing/joining code/link, and limitations (basic P2P, depends on network, not a scalable broadcast service)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an upgrade-safe state migration is required.",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not implement WebSockets or Socket.io; signaling must work without WebSockets (e.g., via polling).",
    "Do not route or store live video bytes through the backend canister; the canister is for signaling only."
  ],
  "nonGoals": [
    "RTMP/HLS/DASH broadcasting or any CDN-style scalable live streaming.",
    "Recording live streams on the backend.",
    "Third-party streaming integrations (YouTube/Twitch/etc.).",
    "Multi-broadcaster studio features (scenes, overlays for live, chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}