{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Basic WebRTC Live Broadcast (P2P) UI with Canister Signaling (Polling)",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Add a Live mode for broadcasting the user’s camera stream via basic peer-to-peer WebRTC, with in-app status/error messaging and a shareable session code/link.",
      "acceptanceCriteria": [
        "Camera screen provides a Live mode entry point distinct from Photo/Video capture.",
        "Broadcaster can start a live session and sees a shareable session code/link.",
        "UI displays connection status (e.g., waiting for viewers/connected/ended) and errors in a user-friendly way.",
        "App copy shown to users is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LiveBroadcastScreen.tsx",
          "operation": "create",
          "description": "Create the broadcaster Live UI: start/stop live session, show a clear disclaimer that this is a basic P2P live feature (not a scalable streaming platform), render connection status (waiting/connected/ended), present session code and shareable link with copy/share actions, and display user-friendly error states. Use the selected \"camera\" component’s useCamera hook for camera preview/stream access; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/live/useLiveBroadcast.ts",
          "operation": "create",
          "description": "Implement a broadcaster-side React hook to manage WebRTC RTCPeerConnection lifecycle, create/refresh offer, gather and post ICE candidates, poll canister signaling for viewer answers/candidates, and expose derived connection/status/error state for the LiveBroadcastScreen. Ensure polling-based signaling only (no WebSockets)."
        },
        {
          "path": "frontend/src/lib/live/signaling.ts",
          "operation": "create",
          "description": "Add a small signaling client wrapper around the backend actor (from useActor) to standardize polling intervals, transient message handling (offer/answer/candidates), basic validation mapping (e.g., invalid/ended session), and conversion between browser RTCIceCandidate and the shared Candidate type used by the backend interface."
        },
        {
          "path": "frontend/src/components/camera/MobileCameraOverlay.tsx",
          "operation": "modify",
          "description": "Extend the capture mode toggle to include a distinct \"Live\" mode entry alongside Photo/Video, with appropriate disabling while recording/live is active. Keep all labels/copy in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CameraScreen.tsx",
          "operation": "modify",
          "description": "Add a Live mode entry point in the camera experience distinct from Photo/Video (using the overlay toggle). When Live is selected, route the user into the broadcaster Live experience (LiveBroadcastScreen) while keeping the standard camera preview behavior. Use the selected \"camera\" component’s useCamera hook for preview/stream access; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire Live broadcast into app navigation state: introduce a Live screen state, render LiveBroadcastScreen when selected, and pass navigation callbacks from CameraScreen to enter/exit Live mode. Also ensure app-level URL handling can preserve/share a viewer link (without adding unrelated routes)."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add a Viewer experience to join a live session by code or link, connect via WebRTC using polling-based canister signaling, and play the stream in an HTML5 video element with clear states.",
      "acceptanceCriteria": [
        "Viewer can join by session code and/or a shareable link generated by the broadcaster.",
        "Viewer sees a live video element that starts playing after successful connection.",
        "Viewer sees clear empty/loading/error states (e.g., invalid code, broadcaster offline, connection failed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LiveViewerScreen.tsx",
          "operation": "create",
          "description": "Create the viewer UI: session code input + join action, auto-join from a shareable link (e.g., query/hash-based), show loading/empty/error states (invalid code, broadcaster offline, connection failed), and render an HTML5 video element with standard controls once the remote stream is attached."
        },
        {
          "path": "frontend/src/hooks/live/useLiveViewer.ts",
          "operation": "create",
          "description": "Implement a viewer-side React hook to create RTCPeerConnection, poll for the broadcaster offer, set remote description, create/send answer, exchange ICE candidates via polling-based signaling, and expose connection/status/error state used by LiveViewerScreen."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire LiveViewerScreen into the app: add a viewer screen state and implement link handling so opening a shareable live link in the app navigates directly to the viewer join flow (pre-filling session code and starting connection). Also provide navigation back to Camera/Gallery as appropriate."
        },
        {
          "path": "frontend/src/pages/LiveBroadcastScreen.tsx",
          "operation": "modify",
          "description": "Ensure the broadcaster screen generates a shareable viewer link that the app can parse (e.g., includes a session code in URL query/hash) and that it is easy to copy/share. Show clear status text indicating when viewers are connected vs waiting."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update the Help modal with an English Live section explaining how to start/join Live, required permissions, and key peer-to-peer limitations.",
      "acceptanceCriteria": [
        "Help modal contains a clearly labeled 'Live' (or 'Live Streaming') section in English.",
        "Help content describes: starting Live, sharing/joining code/link, and limitations (basic P2P, depends on network, not a scalable broadcast service)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HelpModal.tsx",
          "operation": "modify",
          "description": "Add a new Help section labeled \"Live\" / \"Live Streaming\" describing: how to start a Live broadcast, how to share the session code/link, how viewers join, required permissions (camera/microphone if applicable), and limitations (basic P2P reliability, network/NAT constraints, backend does not host/relay video bytes). Keep all copy in English."
        }
      ]
    }
  ]
}